'''
3 × 3 の整数行列
B =
4 −2 0
3 −3 −3
−1 −6 −1
で生成される 3 次元格子を L = L(B) とする
vol(L) = abs(det(B))
'''
B = Matrix(ZZ, [[4, -2, 0],
                [3, -3, -3],
                [-1, -6, -1]])
print('B=' , B)

C1 = Matrix(ZZ, [[143, -20, 19],
                [-241, -64, -45],
                [110, -5, 16]])
print('C1=' , C1)

C2 = Matrix(ZZ, [[-26357, 13270, 2307],
                [4836, -2438, -424],
                [-105971, 53351, 9275]])
print('C2=' , C2)

T1 = C1*B**(-1) #C1 = T1B, C2 = T2Bを満たす
T2 = C2*B**(-1) # 2 つのユニモジュラ行列 T1,T2

print('T1 = ', T1)
print('T2 = ', T2)
print('det(T1) =', det(T1)) #ユニモジュラ確認
print('det(T2) =', det(T2)) #ユニモジュラ確認
print('3次元格子Lの体積')
print('Vol = ', abs(det(C2)))

'''
output
B= [ 4 -2  0]
[ 3 -3 -3]
[-1 -6 -1]
C1= [ 143  -20   19]
[-241  -64  -45]
[ 110   -5   16]
C2= [ -26357   13270    2307]
[   4836   -2438    -424]
[-105971   53351    9275]
T1 =  [ 37  -4  -7]
[-58   6  27]
[ 28  -3  -7]
T2 =  [ -5924   -828    177]
[  1087    152    -32]
[-23818  -3329    712]
det(T1) = 1
det(T2) = 1
3次元格子Lの体積を求めよ
Vol =  72

'''

